# One-to-Many and Many-to-Many Joins - Lab

## Introduction

In this lab, you'll practice your knowledge on One-to-Many and Many-to-many relationships!

## Objectives

You will be able to:
- Query data including Many-to-Many relationships
- Write queries that make use of Join Tables

## One-to-Many and Many-to-Many Joins
<img src='Database-Schema.png' width=550>

## Employees and their Office (a One-to-One join)

Return a list of all of the employees with their first name, last name and the city and state of the office that they work out of (if they have one). Include all employees and order them by their first name, then their last name.

In [1]:
#Your code here
import sqlite3
import pandas as pd
conn = sqlite3.connect('data.sqlite', detect_types=sqlite3.PARSE_COLNAMES)
cur = conn.cursor()

In [24]:
query1 = '''
SELECT 
  employees.firstName 
, employees.lastName
, offices.city
, offices.state
FROM 
  employees 
JOIN offices 
  USING(officeCode)
ORDER BY 
  employees.firstName
, employees.lastName
;
'''

In [25]:
result = cur.execute(query1)
result_data = list(result)

In [26]:
columns = [row[0] for row in result.description]

In [28]:
pd.DataFrame(result_data, columns=columns).head()

  firstName lastName           city state
0      Andy   Fixter         Sydney
1   Anthony      Bow  San Francisco    CA
2     Barry    Jones         London
3     Diane   Murphy  San Francisco    CA
4  Foon Yue    Tseng            NYC    NY

In [29]:
result = cur.execute(query1)

In [30]:
result_data = list(result)
len(result_data)

23

## Customers and their Orders (a One-to-Many join)

Return a list of all of the customers. For each customer return a record for each of their order numbers, order dates and statuses.

In [31]:
# Your code here
query2 = '''
SELECT 
  customers.customerName
, orders.orderNumber
, orders.orderDate
, orders.status
FROM customers
JOIN orders USING(customerNumber);
'''

In [32]:
pd.DataFrame(cur.execute(query2).fetchall(), columns=[row[0] for row in cur.execute(query2).description]).head()

         customerName orderNumber   orderDate   status
0   Atelier graphique       10123  2003-05-20  Shipped
1   Atelier graphique       10298  2004-09-27  Shipped
2   Atelier graphique       10345  2004-11-25  Shipped
3  Signal Gift Stores       10124  2003-05-21  Shipped
4  Signal Gift Stores       10278  2004-08-06  Shipped

## Orders and their Order Details (another One-to-Many join)

Return a list of orders. For each order return a record for each order detail within the order.

In [22]:
# Your code here
query = '''
SELECT 
  o.orderNumber
, p.productCode
, p.productName
, o.quantityOrdered
, o.priceEach
FROM
  orderdetails o
JOIN 
  products p
USING(productCode);
'''

In [23]:
pd.DataFrame(cur.execute(q).fetchall(), columns=[row[0] for row in cur.execute(q).description]).head()

,orderNumber,productCode,productName,quantityOrdered,priceEach
0,10100,S18_1749,1917 Grand Touring Sedan,30,136.00
1,10100,S18_2248,1911 Ford Town Car,50,55.09
2,10100,S18_4409,1932 Alfa Romeo 8C2300 Spider Sport,22,75.46
3,10100,S24_3969,1936 Mercedes Benz 500k Roadster,49,35.29
4,10101,S18_2325,1932 Model A Ford J-Coupe,25,108.06

## Orders, Order details and Product Details (a Many-to-Many Join)

Return a list of the orders with the the order information, and all the product information for each product in the order.

In [4]:
# Your code here
q = 
'''
SELECT 
'''

## Summary

In this lab, you practiced your knowledge on One-to-Many and Many-to-many relationships!